0000009993.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><GTTMSG01 xmlns="urn:sap-com:document:sap:idoc:soap:messages"><IDOC BEGIN="1"><EDI_DC40 SEGMENT="1"><RCVPRN>SAPGTT</RCVPRN><DOCREL>754</DOCREL><SNDPRT>LS</SNDPRT><SNDPOR>SAPXLS</SNDPOR><MESTYP>GTTMSG</MESTYP><RCVPRT>LS</RCVPRT><RCVPOR>GTT_TPEV</RCVPOR><DOCNUM>0000000000010000</DOCNUM><SNDPRN>[APPLICATION-APPSYS]</SNDPRN><TABNAM>EDI_DC40</TABNAM><OUTMOD>2</OUTMOD><MANDT>100</MANDT><STATUS>30</STATUS><IDOCTYP>GTTMSG01</IDOCTYP><CREDAT>[Current Date]</CREDAT><CRETIM>[Current Time]</CRETIM><DIRECT>1</DIRECT></EDI_DC40><E1EHPAO SEGMENT="1"><APPSYS>XLSCLNT100</APPSYS><APPOBJTYPE>ZGTT_SHP_ACC_HD</APPOBJTYPE><APPOBJID>0000009993</APPOBJID><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_NOZ</PARAMNAME><PARAMINDEX>0000000000</PARAMINDEX><VALUE>0000009993</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_SA_ERP_ID</PARAMNAME><PARAMINDEX>0000000000</PARAMINDEX><VALUE>LBNRCARR1</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_SA_LBN_ID</PARAMNAME><PARAMINDEX>0000000000</PARAMINDEX><VALUE>LBN#10010001425</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>Z_CONT_ID</PARAMNAME><PARAMINDEX>0000000000</PARAMINDEX><VALUE>CMA1234</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_SHIPPING_TYPE</PARAMNAME><PARAMINDEX>0000000000</PARAMINDEX><VALUE>18</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_TRANSPORTATION_MODE</PARAMNAME><PARAMINDEX>0000000000</PARAMINDEX><VALUE>03</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>ACTUAL_BUSINESS_TIMEZONE</PARAMNAME><PARAMINDEX>0000000000</PARAMINDEX><VALUE>CET</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>ACTUAL_BUSINESS_DATETIME</PARAMNAME><PARAMINDEX>0000000000</PARAMINDEX><VALUE>020210517100002</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>ACTUAL_TECHNICAL_TIMEZONE</PARAMNAME><PARAMINDEX>0000000000</PARAMINDEX><VALUE>CET</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>ACTUAL_TECHNICAL_DATETIME</PARAMNAME><PARAMINDEX>0000000000</PARAMINDEX><VALUE>020210517100002</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_LINE_COUNT</PARAMNAME><PARAMINDEX>0000000001</PARAMINDEX><VALUE>0001</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_STOP_ID</PARAMNAME><PARAMINDEX>0000000001</PARAMINDEX><VALUE>00000099930001</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_ORDINAL_NO</PARAMNAME><PARAMINDEX>0000000001</PARAMINDEX><VALUE>1</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_LOC_CATEGORY</PARAMNAME><PARAMINDEX>0000000001</PARAMINDEX><VALUE>S</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_LOC_TYPE</PARAMNAME><PARAMINDEX>0000000001</PARAMINDEX><VALUE>ShippingPoint</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_LOC_ID</PARAMNAME><PARAMINDEX>0000000001</PARAMINDEX><VALUE>GTT1</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_STAGE_SEQUENCE</PARAMNAME><PARAMINDEX>0000000001</PARAMINDEX><VALUE>0001</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_STOP_PLAN_DATETIME</PARAMNAME><PARAMINDEX>0000000001</PARAMINDEX><VALUE>020210514100000</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_STOP_PLAN_TIMEZONE</PARAMNAME><PARAMINDEX>0000000001</PARAMINDEX><VALUE>CET</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_LINE_COUNT</PARAMNAME><PARAMINDEX>0000000002</PARAMINDEX><VALUE>0002</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_STOP_ID</PARAMNAME><PARAMINDEX>0000000002</PARAMINDEX><VALUE>00000099930001</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_ORDINAL_NO</PARAMNAME><PARAMINDEX>0000000002</PARAMINDEX><VALUE>2</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_LOC_CATEGORY</PARAMNAME><PARAMINDEX>0000000002</PARAMINDEX><VALUE>D</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_LOC_TYPE</PARAMNAME><PARAMINDEX>0000000002</PARAMINDEX><VALUE>Customer</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_LOC_ID</PARAMNAME><PARAMINDEX>0000000002</PARAMINDEX><VALUE>ZGTT_C1</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_STAGE_SEQUENCE</PARAMNAME><PARAMINDEX>0000000002</PARAMINDEX><VALUE>0001</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_STOP_PLAN_DATETIME</PARAMNAME><PARAMINDEX>0000000002</PARAMINDEX><VALUE>020210515100000</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_STOP_PLAN_TIMEZONE</PARAMNAME><PARAMINDEX>0000000002</PARAMINDEX><VALUE>CET</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_PLN_DEP_BUS_DATETIME</PARAMNAME><PARAMINDEX>0000000000</PARAMINDEX><VALUE>020210514100000</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_PLN_DEP_BUS_TIMEZONE</PARAMNAME><PARAMINDEX>0000000000</PARAMINDEX><VALUE>CET</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_PLN_DEP_LOC_ID</PARAMNAME><PARAMINDEX>0000000000</PARAMINDEX><VALUE>GTT1</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_PLN_DEP_LOC_TYPE</PARAMNAME><PARAMINDEX>0000000000</PARAMINDEX><VALUE>ShippingPoint</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_PLN_AR_BUS_DATETIME</PARAMNAME><PARAMINDEX>0000000000</PARAMINDEX><VALUE>020210515100000</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_PLN_AR_BUS_TIMEZONE</PARAMNAME><PARAMINDEX>0000000000</PARAMINDEX><VALUE>CET</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_PLN_AR_LOC_ID</PARAMNAME><PARAMINDEX>0000000000</PARAMINDEX><VALUE>ZGTT_C1</VALUE></E1EHPCP><E1EHPCP SEGMENT="1"><PARAMNAME>YN_SHP_PLN_AR_LOC_TYPE</PARAMNAME><PARAMINDEX>0000000000</PARAMINDEX><VALUE>Customer</VALUE></E1EHPCP><E1EHPEE SEGMENT="1"><MILESTONENUM>0000000001</MILESTONENUM><MILESTONE>CHECK_IN</MILESTONE><LOCTYPE>ShippingPoint</LOCTYPE><LOCID1>GTT1</LOCID1><LOCID2>00000099930001</LOCID2><MSG_EXP_DATETIME>020210601100000</MSG_EXP_DATETIME><MSG_ER_EXP_DTIME/><MSG_LT_EXP_DTIME/><EVT_EXP_DATETIME/><EVT_ER_EXP_DTIME/><EVT_LT_EXP_DTIME/><EVT_EXP_TZONE/></E1EHPEE><E1EHPEE SEGMENT="1"><MILESTONENUM>0000000002</MILESTONENUM><MILESTONE>LOAD_BEGIN</MILESTONE><LOCTYPE>ShippingPoint</LOCTYPE><LOCID1>GTT1</LOCID1><LOCID2>00000099930001</LOCID2><MSG_EXP_DATETIME>020210601110000</MSG_EXP_DATETIME><MSG_ER_EXP_DTIME/><MSG_LT_EXP_DTIME/><EVT_EXP_DATETIME/><EVT_ER_EXP_DTIME/><EVT_LT_EXP_DTIME/><EVT_EXP_TZONE/></E1EHPEE><E1EHPEE SEGMENT="1"><MILESTONENUM>0000000003</MILESTONENUM><MILESTONE>LOAD_END</MILESTONE><LOCTYPE>ShippingPoint</LOCTYPE><LOCID1>GTT1</LOCID1><LOCID2>00000099930001</LOCID2><MSG_EXP_DATETIME>020210601120000</MSG_EXP_DATETIME><MSG_ER_EXP_DTIME/><MSG_LT_EXP_DTIME/><EVT_EXP_DATETIME/><EVT_ER_EXP_DTIME/><EVT_LT_EXP_DTIME/><EVT_EXP_TZONE/></E1EHPEE><E1EHPEE SEGMENT="1"><MILESTONENUM>0000000004</MILESTONENUM><MILESTONE>DEPARTURE</MILESTONE><LOCTYPE>ShippingPoint</LOCTYPE><LOCID1>GTT1</LOCID1><LOCID2>00000099930001</LOCID2><MSG_EXP_DATETIME>020210601130000</MSG_EXP_DATETIME><MSG_ER_EXP_DTIME/><MSG_LT_EXP_DTIME/><EVT_EXP_DATETIME/><EVT_ER_EXP_DTIME/><EVT_LT_EXP_DTIME/><EVT_EXP_TZONE/></E1EHPEE><E1EHPEE SEGMENT="1"><MILESTONENUM>0000000005</MILESTONENUM><MILESTONE>ARRIV_DEST</MILESTONE><LOCTYPE>Customer</LOCTYPE><LOCID1>ZGTT_C1</LOCID1><LOCID2>00000099930002</LOCID2><MSG_EXP_DATETIME>020210610100000</MSG_EXP_DATETIME><MSG_ER_EXP_DTIME/><MSG_LT_EXP_DTIME/><EVT_EXP_DATETIME/><EVT_ER_EXP_DTIME/><EVT_LT_EXP_DTIME/><EVT_EXP_TZONE/></E1EHPEE><E1EHPEE SEGMENT="1"><MILESTONENUM>0000000006</MILESTONENUM><MILESTONE>UNLOAD_BEGIN</MILESTONE><LOCTYPE>Customer</LOCTYPE><LOCID1>ZGTT_C1</LOCID1><LOCID2>00000099930002</LOCID2><MSG_EXP_DATETIME>020210610110000</MSG_EXP_DATETIME><MSG_ER_EXP_DTIME/><MSG_LT_EXP_DTIME/><EVT_EXP_DATETIME/><EVT_ER_EXP_DTIME/><EVT_LT_EXP_DTIME/><EVT_EXP_TZONE/></E1EHPEE><E1EHPEE SEGMENT="1"><MILESTONENUM>0000000007</MILESTONENUM><MILESTONE>UNLOAD_END</MILESTONE><LOCTYPE>Customer</LOCTYPE><LOCID1>ZGTT_C1</LOCID1><LOCID2>00000099930002</LOCID2><MSG_EXP_DATETIME>020210610120000</MSG_EXP_DATETIME><MSG_ER_EXP_DTIME/><MSG_LT_EXP_DTIME/><EVT_EXP_DATETIME/><EVT_ER_EXP_DTIME/><EVT_LT_EXP_DTIME/><EVT_EXP_TZONE/></E1EHPEE><E1EHPEE SEGMENT="1"><MILESTONENUM>0000000008</MILESTONENUM><MILESTONE>POD</MILESTONE><LOCTYPE>Customer</LOCTYPE><LOCID1>ZGTT_C1</LOCID1><LOCID2>00000099930002</LOCID2><MSG_EXP_DATETIME>020210610130000</MSG_EXP_DATETIME><MSG_ER_EXP_DTIME/><MSG_LT_EXP_DTIME/><EVT_EXP_DATETIME/><EVT_ER_EXP_DTIME/><EVT_LT_EXP_DTIME/><EVT_EXP_TZONE/></E1EHPEE><E1EHPTID SEGMENT="1"><TRXCOD>SHIPMENT_ORDER</TRXCOD><TRXID>0000009993</TRXID><START_DATE>20210517100002</START_DATE><END_DATE>099991231000000</END_DATE><TIMZON>CET</TIMZON></E1EHPTID></E1EHPAO></IDOC></GTTMSG01></SOAP-ENV:Body></SOAP-ENV:Envelope>